// Задайте значениям M и N. Напишите программу, которая выведет все натуральные числа в промежутке от M до N/

void f(int n, int m)
{
    if (n != (m-1)) // пока n не равна m -1
    {
        f(n - 1,m);
        Console.Write(n + " ");
    }
}
int n = 10;
int m = 3;
f(n, m);


// void f(int n = 10, int m = 3)
// {
//     if (n != (m - 1))
//     {
//         f(n - 1, m);
//         Console.Write(n + " ");
//     }
// }

// f();
